<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 是否数据库记录发送日志
    |--------------------------------------------------------------------------
    |数据日子存于 Laravel-sms 表中，该表已经存在
    */
    'dbLogs' => true,

    /*
    |--------------------------------------------------------------------------
    | 数据验证管理
    |--------------------------------------------------------------------------
    |
    | 设置从客户端传来的需要验证的数据字段(本库将其称为field),
    | 并管理其启用状态(enable),默认静态验证规则(default)以及所有可用静态验证规则(staticRules)。
    |
    |--------------------------------------------------------------------------
    |
    */
    'validation' => [
        'mobile' => [
            'enable'      => true,
            'default'     => 'mobile_required',
            'staticRules' => [
                'mobile_required'     => 'required|zh_mobile',
                'check_mobile_unique' => 'required|zh_mobile|unique:users,mobile',
                'check_mobile_exists' => 'required|zh_mobile|exists:users',
            ],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | 验证码模块提示信息
    |--------------------------------------------------------------------------
    |
    */
    'notifies' => [
        // 频繁请求无效的提示
        'request_invalid' => '请求无效，请在%s秒后重试',

        // 验证码短信发送失败的提示
        'sms_sent_failure' => '短信验证码发送失败，请稍后重试',

        // 语音验证码发送发送成功的提示
        'voice_sent_failure' => '语音验证码请求失败，请稍后重试',

        // 验证码短信发送成功的提示
        'sms_sent_success' => '短信验证码发送成功，请注意查收',

        // 语音验证码发送发送成功的提示
        'voice_sent_success' => '语音验证码发送成功，请注意接听',
    ],

    /*
    |--------------------------------------------------------------------------
    | 验证码短信相关配置
    |--------------------------------------------------------------------------
    |
    | verifySmsContent:
    | 验证码短信通用内容
    |
    | codeLength:
    | 验证码长度
    |
    | codeValidMinutes:
    | 验证码有效时间长度，单位为分钟(minutes)
    |
    */
    'verifySmsContent' => '【觅处网】验证码：%s， %s分钟内验证有效，请立即验证',
    'codeLength'       => 5,
    'codeValidMinutes' => 15,

    /*
    |--------------------------------------------------------------------------
    | 存储系统配置
    |--------------------------------------------------------------------------
    |
    | prefix:
    | 存储key的prefix
    |
    | storage:
    | 存储方式,是一个实现了'App\Contracts\Storage\Storage'接口的类的类名,
    | 内置可选的值有'App\Services\Storage\SessionStorage'和'App\Services\Storage\CacheStorage',
    |
    */
    'prefix'  => 'laravel_sms',
    'storage' => 'App\Services\Storage\CacheStorage',

    /*
    |--------------------------------------------------------------------------
    | 队列任务
    |--------------------------------------------------------------------------
    |
    */
    'queueJob' => 'App\Jobs\SendReminderSms',
];
