<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DataRegionTableSeeder extends Seeder
{
    private $table;

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $this->table = DB::table('data_regions');
        $this->command->info('清空地址字典表data_regions中的数据');
        $this->table->truncate();

        // 省份和对应的城市列表
        // 数据来源：http://open.weibo.com/wiki/%E7%9C%81%E4%BB%BD%E5%9F%8E%E5%B8%82%E7%BC%96%E7%A0%81%E8%A1%A8
        
        $location_list = [
            '安徽' => [
                1 => "合肥",
                2 => "芜湖",
                3 => "蚌埠",
                4 => "淮南",
                5 => "马鞍山",
                6 => "淮北",
                7 => "铜陵",
                8 => "安庆",
                10 => "黄山",
                11 => "滁州",
                12 => "阜阳",
                13 => "宿州",
                14 => "巢湖",
                15 => "六 安",
                16 => "亳州",
                17 => "池州",
                18 => "宣城"
            ],
            '北京' => [
                0 => '北京',
            ],
            '重庆' => [
                0 => '重庆'
            ],
            '福建' => [
                1 => "福州",
                2 => "厦门",
                3 => "莆田",
                4 => "三明",
                5 => "泉州",
                6 => "漳州",
                7 => "南平",
                8 => "龙岩",
                9 => "宁德"
            ],
            '甘肃' => [
                1 => "兰州",
                2 => "嘉峪关",
                3 => "金昌",
                4 => "白银",
                5 => "天水",
                6 => "武威",
                7 => "张掖",
                8 => "平凉",
                9 => "酒泉",
                10 => "庆阳",
                11 => "定西",
                12 => "陇南",
                13 => "临夏",
                14 => "甘南"
            ],
            '广东' => [
                1 => "广州",
                2 => "韶关",
                3 => "深圳",
                4 => "珠海",
                5 => "汕头",
                6 => "佛山",
                7 => "江门",
                8 => "湛江",
                9 => "茂名",
                10 => "肇庆",
                11 => "惠州",
                12 => "梅州",
                13 => "汕尾",
                14 => "河源",
                15 => "阳江",
                16 => "清远",
                17 => "东莞",
                18 => "中山",
                19 => "潮州",
                20 => "揭阳",
                21 => "云浮"
            ],
            '广西' => [
                1 => "南宁",
                2 => "柳州",
                3 => "桂林",
                4 => "梧州",
                5 => "北海",
                6 => "防城港",
                7 => "钦州",
                8 => "贵港",
                9 => "玉林",
                10 => "百色",
                11 => "贺州",
                12 => "河池",
                13 => "南宁",
                14 => "柳州"
            ],
            '贵州' => [
                1 => "贵阳",
                2 => "六盘水",
                3 => "遵义",
                4 => "安顺",
                5 => "铜仁",
                6 => "黔西南",
                7 => "毕节",
                8 => "黔东南",
                9 => "黔南"
            ],
            '海南' => [1 => "海口", 2 => "三亚", 3 => "其他"],
            '河北' => [
                1 => "石家庄",
                2 => "唐山",
                3 => "秦皇岛",
                4 => "邯郸",
                5 => "邢台",
                6 => "保定",
                7 => "张家口",
                8 => "承德",
                9 => "沧州",
                10 => "廊坊",
                11 => "衡水"
            ],
            '黑龙江' => [
                1 => "哈尔滨",
                2 => "齐齐哈尔",
                3 => "鸡西",
                4 => "鹤岗",
                5 => "双鸭山",
                6 => "大庆",
                7 => "伊春",
                8 => "佳木斯",
                9 => "七台河",
                10 => "牡丹江",
                11 => "黑河",
                12 => "绥化",
                13 => "大兴安岭"
            ],
            '河南' => [
                1 => "郑州",
                2 => "开封",
                3 => "洛阳",
                4 => "平顶山",
                5 => "安阳",
                6 => "鹤壁",
                7 => "新乡",
                8 => "焦作",
                9 => "濮阳",
                10 => "许昌",
                11 => "漯河",
                12 => "三门峡",
                13 => "南阳",
                14 => "商丘",
                15 => "信阳",
                16 => "周口",
                17 => "驻马店"
            ],
            '湖北' => [
                1 => "武汉",
                2 => "黄石",
                3 => "十堰",
                4 => "宜昌",
                5 => "襄樊",
                6 => "鄂州",
                7 => "荆门",
                8 => "孝感",
                9 => "荆州",
                10 => "黄冈",
                11 => "咸宁",
                12 => "随州",
                13 => "恩施土家族苗族自治州"
            ],
            '湖南' => [
                1 => "长沙",
                2 => "株洲",
                3 => "湘潭",
                4 => "衡阳",
                5 => "邵阳",
                6 => "岳阳",
                7 => "常德",
                8 => "张家界",
                9 => "益阳",
                10 => "郴州",
                11 => "永州",
                12 => "怀化",
                13 => "娄底",
                14 => "湘西土家族苗族自治州"
            ],
            '内蒙古' => [
                1 => "呼和浩特",
                2 => "包头",
                3 => "乌海",
                4 => "赤峰",
                5 => "通辽",
                6 => "鄂尔多斯",
                7 => "呼伦贝尔",
                8 => "兴安盟",
                9 => "锡林郭勒盟",
                10 => "乌兰察布盟",
                11 => "巴彦淖尔盟",
                12 => "阿拉善盟"
            ],
            '江苏' => [
                1 => "南京",
                2 => "无锡",
                3 => "徐州",
                4 => "常州",
                5 => "苏州",
                6 => "南通",
                7 => "连云港",
                8 => "淮安",
                9 => "盐城",
                10 => "扬州",
                11 => "镇江",
                12 => "泰州",
                13 => "宿迁"
            ],
            '江西' => [
                1 => "南昌",
                2 => "景德镇",
                3 => "萍乡",
                4 => "九江",
                5 => "新余",
                6 => "鹰潭",
                7 => "赣州",
                8 => "吉安",
                9 => "宜春",
                10 => "抚州",
                11 => "上饶"
            ],
            '吉林' => [
                1 => "长春",
                2 => "吉林",
                3 => "四平",
                4 => "辽源",
                5 => "通化",
                6 => "白山",
                7 => "松原",
                8 => "白城",
                9 => "延边朝鲜族自治州"
            ],
            '辽宁' => [
                1 => "沈阳",
                2 => "大连",
                3 => "鞍山",
                4 => "抚顺",
                5 => "本溪",
                6 => "丹东",
                7 => "锦州",
                8 => "营口",
                9 => "阜新",
                10 => "辽阳",
                11 => "盘锦",
                12 => "铁岭",
                13 => "朝阳",
                14 => "葫芦岛"
            ],
            '宁夏' => [1 => "银川", 2 => "石嘴山", 3 => "吴忠", 4 => "固原"],
            '青海' => [
                1 => "西宁",
                2 => "海东",
                3 => "海北",
                4 => "黄南",
                5 => "海南",
                6 => "果洛",
                7 => "玉树",
                8 => "海西"
            ],
            '山西' => [
                1 => "太原",
                2 => "大同",
                3 => "阳泉",
                4 => "长治",
                5 => "晋城",
                6 => "朔州",
                7 => "晋中",
                8 => "运城",
                9 => "忻州",
                10 => "临汾",
                11 => "吕梁"
            ],
            '山东' => [
                1 => "济南",
                2 => "青岛",
                3 => "淄博",
                4 => "枣庄",
                5 => "东营",
                6 => "烟台",
                7 => "潍坊",
                8 => "济宁",
                9 => "泰安",
                10 => "威海",
                11 => "日照",
                12 => "莱芜",
                13 => "临沂",
                14 => "德州",
                15 => "聊城",
                16 => "滨州",
                17 => "菏泽"
            ],
            '上海' => [
                0 => '上海',
            ],
            '四川' => [
                1 => "成都",
                2 => "自贡",
                3 => "攀枝花",
                4 => "泸州",
                5 => "德阳",
                6 => "绵阳",
                7 => "广元",
                8 => "遂宁",
                9 => "内江",
                10 => "乐山",
                11 => "南充",
                12 => "眉山",
                13 => "宜宾",
                14 => "广安",
                15 => "达州",
                16 => "雅安",
                17 => "巴中",
                18 => "资阳",
                19 => "阿坝",
                20 => "甘孜",
                21 => "凉山"
            ],
            '天津' => [
                0 => '天津',
            ],
            '西藏' => [
                1 => "拉萨",
                2 => "昌都",
                3 => "山南",
                4 => "日喀则",
                5 => "那曲",
                6 => "阿里",
                7 => "林芝"
            ],
            '新疆' => [
                1 => "乌鲁木齐",
                2 => "克拉玛依",
                3 => "吐鲁番",
                4 => "哈密",
                5 => "昌吉",
                6 => "博尔塔拉",
                7 => "巴音郭楞",
                8 => "阿克苏",
                9 => "克孜勒苏",
                10 => "喀什",
                11 => "和田",
                12 => "伊犁",
                13 => "塔城",
                14 => "阿勒泰"
            ],
            '云南' => [
                1 => "昆明",
                2 => "曲靖",
                3 => "玉溪",
                4 => "保山",
                5 => "昭通",
                6 => "楚雄",
                7 => "红河",
                8 => "文山",
                9 => "思茅",
                10 => "西双版纳",
                11 => "大理",
                12 => "德宏",
                13 => "丽江",
                15 => "怒江",
                16 => "迪庆",
                17 => "临沧"
            ],
            '浙江' => [
                1 => "杭州",
                2 => "宁波",
                3 => "温州",
                4 => "嘉兴",
                5 => "湖州",
                6 => "绍兴",
                7 => "金华",
                8 => "Q衢州",
                9 => "舟山",
                10 => "台州",
                11 => "丽水"
            ],
            '陕西' => [
                1 => "西安",
                2 => "铜川",
                3 => "宝鸡",
                4 => "咸阳",
                5 => "渭南",
                6 => "延安",
                7 => "汉中",
                8 => "榆林",
                9 => "安康",
                10 => "商洛"
            ],
            '台湾' => [1 => "台北", 2 => "高雄", 3 => "其他"],
            '香港' => [1 => "香港"],
            '澳门' => [1 => '澳门'],
            '海外' => [
                1 => "美国",
                2 => "英国",
                3 => "法国",
                4 => "俄罗斯",
                5 => "加拿大",
                6 => "巴西",
                7 => "澳大利亚",
                8 => "印尼",
                9 => "泰国",
                10 => "马来西亚",
                11 => "新加坡",
                12 => "菲律宾",
                13 => "越南",
                14 => "印度",
                15 => "日本",
                16 => "其他"
            ],
        ];

        foreach ($location_list as $state_name => $city_list) {
            self::addStateAndCityRecursive($state_name, $city_list);
        }

        $this->command->info('地址字典表data_regions字典数据成功生成');
    }

    public static function addStateAndCityRecursive($state_name, $city_list)
    {
        // 先添加省份
        $parent_id = DB::table('data_regions')->insertGetId([
            'name' => $state_name,
            'parent_id' => 0,
        ]);

        // 循环插入城市
        foreach ($city_list as $dummy => $city_name) {
            DB::table('data_regions')->insert([
                'name' => $city_name,
                'parent_id' => $parent_id,
            ]);
        }
    }
}
